cmsis-svd/cmsis-svd/data/Atmel/ATSAMV71J19B.svd
                              <description>AES_RX</description>
                              <value>38</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PWM1</name>
                              <description>PWM1</description>
                              <value>39</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TC0</name>
                              <description>TC0</description>
                              <value>40</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TC3</name>
                              <description>TC3</description>
                              <value>41</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TC6</name>
                              <description>TC6</description>
                              <value>42</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TC9</name>
                              <description>TC9</description>
                              <value>43</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CDS_MSP</name>
                  <description>Channel Data Stride Memory Set Pattern</description>
                  <addressOffset>0x2C</addressOffset>
                  <size>32</size>
                  <fields>
                     <field>
                        <name>SDS_MSP</name>
                        <description>Channel x Source Data stride or Memory Set Pattern</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                     <field>
                        <name>DDS_MSP</name>
                        <description>Channel x Destination Data Stride or Memory Set Pattern</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CSUS</name>
                  <description>Channel Source Microblock Stride</description>
                  <addressOffset>0x30</addressOffset>
                  <size>32</size>
                  <fields>
                     <field>
                        <name>SUBS</name>
                        <description>Channel x Source Microblock Stride</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>24</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CDUS</name>
                  <description>Channel Destination Microblock Stride</description>
                  <addressOffset>0x34</addressOffset>
                  <size>32</size>
                  <fields>
                     <field>
                        <name>DUBS</name>
                        <description>Channel x Destination Microblock Stride</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>24</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
         </registers>
      </peripheral>
      <peripheral>
         <name>LOCKBIT</name>
         <groupName>LOCKBIT</groupName>
         <prependToName>LOCKBIT_</prependToName>
         <baseAddress>0</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>WORD0</name>
               <description>Lock Bits Word 0</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>LOCK_REGION_0</name>
                     <description>Lock Region 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_1</name>
                     <description>Lock Region 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_2</name>
                     <description>Lock Region 2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_3</name>
                     <description>Lock Region 3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_4</name>
                     <description>Lock Region 4</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_5</name>
                     <description>Lock Region 5</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_6</name>
                     <description>Lock Region 6</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_7</name>
                     <description>Lock Region 7</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_8</name>
                     <description>Lock Region 8</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_9</name>
                     <description>Lock Region 9</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_10</name>
                     <description>Lock Region 10</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_11</name>
                     <description>Lock Region 11</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_12</name>
                     <description>Lock Region 12</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_13</name>
                     <description>Lock Region 13</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_14</name>
                     <description>Lock Region 14</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_15</name>
                     <description>Lock Region 15</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_16</name>
                     <description>Lock Region 16</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_17</name>
                     <description>Lock Region 17</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_18</name>
                     <description>Lock Region 18</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_19</name>
                     <description>Lock Region 19</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_20</name>
                     <description>Lock Region 20</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_21</name>
                     <description>Lock Region 21</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_22</name>
                     <description>Lock Region 22</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_23</name>
                     <description>Lock Region 23</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_24</name>
                     <description>Lock Region 24</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_25</name>
                     <description>Lock Region 25</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_26</name>
                     <description>Lock Region 26</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_27</name>
                     <description>Lock Region 27</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_28</name>
                     <description>Lock Region 28</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_29</name>
                     <description>Lock Region 29</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_30</name>
                     <description>Lock Region 30</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_31</name>
                     <description>Lock Region 31</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
